# Brewfile — reproduce this machine's Homebrew setup with `brew bundle`.
# Only top-level packages are listed; Homebrew resolves dependencies
# (openssl@3, icu4c, readline, libuv, etc.) automatically.

# --- Formulae ---
brew "git"
brew "nvm"
brew "pyenv"
brew "mongosh"

# Zsh plugins (sourced from the Homebrew prefix in .zshrc).
# history-substring-search is NOT here — it ships bundled with Oh My Zsh and is
# enabled via plugins=() in .zshrc, so no separate install is needed.
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# --- Fonts ---
cask "font-jetbrains-mono-nerd-font"

# --- Casks ---
cask "1password"
cask "appcleaner"
cask "bruno"
cask "claude-code"
cask "datagrip"
cask "dbeaver-community"
cask "ghostty"
cask "google-chrome"
cask "mac-mouse-fix"
cask "meetingbar"
cask "nosqlbooster-for-mongodb"
cask "notion"
cask "openvpn-connect"
cask "orbstack"
cask "raycast"
cask "shottr"
cask "slack"
cask "visual-studio-code"
cask "zoom"
